In [1]:
import pandas as pd

series=1d labelled array
dataframe=2d labelled array

In [2]:
info={
  "name":["Harshit","Hitesh"],
  "cgpa":[9.5,8.9]
}

df=pd.DataFrame(info)
print(df)

      name  cgpa
0  Harshit   9.5
1   Hitesh   8.9

In [3]:
df #keys are header and values into rows with labels

      name  cgpa
0  Harshit   9.5
1   Hitesh   8.9

In [4]:
ds=pd.Series([1,2,3,4,5])
ds
print(type(ds),ds) #dtype is also printed together

<class 'pandas.Series'> 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#custom labels
s=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s
print(s['c'])
print(s.index)

3
Index(['a', 'b', 'c', 'd', 'e'], dtype='str')

In [6]:
#vectorization=no loops drop(index)

s1=pd.Series([10,20,30,40])
s2=pd.Series([2,3,4,5])
print(s1+s2)

s1[0]=100
new_s1=s1.drop(0) #size immutable in pandas so new s1 is created
print(s1)
s2=s2.add(100)
print(s2)
print(new_s1)

0    12
1    23
2    34
3    45
dtype: int64
0    100
1     20
2     30
3     40
dtype: int64
0    102
1    103
2    104
3    105
dtype: int64
1    20
2    30
3    40
dtype: int64

In [7]:
info={
  "name":["Harshit","Hitesh"],
  "cgpa":[9.5,8.9],
  "age":[20,16]
}

df1=pd.DataFrame(info)
df1

#label change
print(df1.index)
print(df1.columns)

RangeIndex(start=0, stop=2, step=1)
Index(['name', 'cgpa', 'age'], dtype='str')

In [8]:
#list in list
df_list=pd.DataFrame([["Harshit",20],["Hitesh",16],["Kiran",54],["Davinder",54]],columns=["Name","Age"])
df_list

       Name  Age
0   Harshit   20
1    Hitesh   16
2     Kiran   54
3  Davinder   54

In [9]:
#numpy array

import numpy as np
np_array=np.array([["Harshit",20],["Hitesh",16],["Kiran",54],["Davinder",54]])
df_np=pd.DataFrame(np_array,columns=["Name","Age"])
df_np

       Name Age
0   Harshit  20
1    Hitesh  16
2     Kiran  54
3  Davinder  54

In [10]:
#open csv and json files

df_csv=pd.read_csv("raw_data.csv")
print(df_csv,type(df_csv))
df_json=pd.read_json("print.json")
print(df_json,type(df_json))

   Unnamed: 0          Name  Age Country Gender  Salary  Tax(in %)  \
0           0           NaN   45      IN      F   73000         20
1           1    Ahmed Khan   38      IN      M   68000         20
2           2    Rachel Lee   29      US      F   62000         20
3           3    Jane Smith   29     CAN      F   62000         20
4           4   Emily Davis   31      US      F   58000         20
5           5      John Doe   29      US      M   55000         20
6           6        Li Wei   27      US      M   51000         20
7           7          Alex   27      US      U   47000         20
8           8   Carlos Ruiz   27    Mxco      M   45000         20
9           9  Maria Garcia   34     SPN      F   45000         10

   Salary_in_hand  Rank  Id
0           58400     1   6
1           54400     2   7
2           49600     3   8
3           49600     3   2
4           46400     4  10
5           44000     5   1
6           40800     6   5
7           37600     7   3
8           36000     8   9
9           36000     8   4   <class 'pandas.DataFrame'>
       name  rating                   feedback   age
0     Alice     5.0            Great product!!    25
1       Bob     4.0       ok but late Delivery    30
2   Charlie     2.0            BAD EXPERIENCE   None
3     Diana     5.0                  Loved it!    28
4       Eve     3.5  Average - could be better    20 <class 'pandas.DataFrame'>

In [11]:
#dataframe methods
df_csv.head()
df_csv.tail()
df_csv.sample(2)
df_csv.info()
df_csv.shape
df_csv.describe()
df_csv.columns
df_csv.nunique()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      10 non-null     int64
 1   Name            9 non-null      str
 2   Age             10 non-null     int64
 3   Country         10 non-null     str
 4   Gender          10 non-null     str
 5   Salary          10 non-null     int64
 6   Tax(in %)       10 non-null     int64
 7   Salary_in_hand  10 non-null     int64
 8   Rank            10 non-null     int64
 9   Id              10 non-null     int64
dtypes: int64(7), str(3)
memory usage: 932.0 bytes

Unnamed: 0        10
Name               9
Age                6
Country            5
Gender             3
Salary             8
Tax(in %)          2
Salary_in_hand     8
Rank               8
Id                10
dtype: int64

In [12]:
df_aqi=pd.read_csv("data_date.csv")
df_aqi.head()
df_aqi.tail()
df_aqi.sample(2)
df_aqi.info()
df_aqi.describe()
df_aqi.shape
df_aqi.columns
df_aqi.nunique()

<class 'pandas.DataFrame'>
RangeIndex: 23423 entries, 0 to 23422
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       23423 non-null  str
 1   Country    23423 non-null  str
 2   Status     23423 non-null  str
 3   AQI Value  23423 non-null  int64
dtypes: int64(1), str(3)
memory usage: 732.1 KB

Date         173
Country      142
Status         6
AQI Value    369
dtype: int64

In [13]:
df_aqi["Country"] #columns
df_aqi.loc[0] #for labels rows
df_aqi.loc[0:2] #end index is included

df_aqi.iloc[0]
df_aqi.iloc[0:2] #end index is not included

df_aqi.loc[0:2,["Country","Date"]]
#we can't do this with iloc because it requires numeric index
df_aqi.iloc[0,1] 
#single scalar value
df_aqi.at[0,"Country"]

df_aqi.iat[0,1] #iat takes numeric index

'Albania'

In [14]:
#filtering data
df_aqi[df_aqi["AQI Value"]>100]["Country"]
df_aqi["Date"]=pd.to_datetime(df_aqi["Date"])

df_aqi[(df_aqi["AQI Value"]>100) & (df_aqi["Date"].dt.month>7)][["Country","AQI Value"]]

#df[df["Date"].dt.year == 2023] Filter by year
#df[df["Date"].dt.month == 6]Filter by month
#df[df["Date"].dt.weekday >= 5] Filter weekends only

                        Country  AQI Value
2261                     Angola        121
2267                    Bahrain        151
2268                 Bangladesh        141
2278               Burkina Faso        107
2283   Central African Republic        113
...                         ...        ...
22736                  Thailand        161
22738                    Turkey        172
22739                    Uganda        113
22741      United Arab Emirates        123
22743  United States of America        104

[1993 rows x 2 columns]

In [15]:
#query method
df_aqi.query("`AQI Value` > 100")[["Country","Status"]]

aqi=120
#using python var
aqi_data=df_aqi.query("`AQI Value`> @aqi & Country =='India'")[["Country","Status"]].copy()
print(aqi_data)

      Country          Status
59      India       Unhealthy
201     India       Unhealthy
343     India  Very Unhealthy
484     India       Unhealthy
625     India       Unhealthy
...       ...             ...
22902   India  Very Unhealthy
23015   India       Hazardous
23128   India       Hazardous
23240   India       Unhealthy
23353   India       Unhealthy

[182 rows x 2 columns]

In [16]:
#handle missing values
df_csv.isnull()
df_csv.isnull().sum()
drop_null=df_csv.dropna().copy()
print(drop_null)
drop_nullCol=df_csv.dropna(axis=1).copy()
print(f"Here{drop_nullCol}")
fill_null=df_csv.fillna("Chutiye").copy()
print(fill_null)
forward_fill=df_csv.ffill().copy()
print(forward_fill)
back_fill=df_csv.bfill().copy()
back_fill

   Unnamed: 0          Name  Age Country Gender  Salary  Tax(in %)  \
1           1    Ahmed Khan   38      IN      M   68000         20
2           2    Rachel Lee   29      US      F   62000         20
3           3    Jane Smith   29     CAN      F   62000         20
4           4   Emily Davis   31      US      F   58000         20
5           5      John Doe   29      US      M   55000         20
6           6        Li Wei   27      US      M   51000         20
7           7          Alex   27      US      U   47000         20
8           8   Carlos Ruiz   27    Mxco      M   45000         20
9           9  Maria Garcia   34     SPN      F   45000         10

   Salary_in_hand  Rank  Id
1           54400     2   7
2           49600     3   8
3           49600     3   2
4           46400     4  10
5           44000     5   1
6           40800     6   5
7           37600     7   3
8           36000     8   9
9           36000     8   4
Here   Unnamed: 0  Age Country Gender  Salary  Tax(in %)  Salary_in_hand  Rank  Id
0           0   45      IN      F   73000         20           58400     1   6
1           1   38      IN      M   68000         20           54400     2   7
2           2   29      US      F   62000         20           49600     3   8
3           3   29     CAN      F   62000         20           49600     3   2
4           4   31      US      F   58000         20           46400     4  10
5           5   29      US      M   55000         20           44000     5   1
6           6   27      US      M   51000         20           40800     6   5
7           7   27      US      U   47000         20           37600     7   3
8           8   27    Mxco      M   45000         20           36000     8   9
9           9   34     SPN      F   45000         10           36000     8   4
   Unnamed: 0          Name  Age Country Gender  Salary  Tax(in %)  \
0           0       Chutiye   45      IN      F   73000         20
1           1    Ahmed Khan   38      IN      M   68000         20
2           2    Rachel Lee   29      US      F   62000         20
3           3    Jane Smith   29     CAN      F   62000         20
4           4   Emily Davis   31      US      F   58000         20
5           5      John Doe   29      US      M   55000         20
6           6        Li Wei   27      US      M   51000         20
7           7          Alex   27      US      U   47000         20
8           8   Carlos Ruiz   27    Mxco      M   45000         20
9           9  Maria Garcia   34     SPN      F   45000         10

   Salary_in_hand  Rank  Id
0           58400     1   6
1           54400     2   7
2           49600     3   8
3           49600     3   2
4           46400     4  10
5           44000     5   1
6           40800     6   5
7           37600     7   3
8           36000     8   9
9           36000     8   4
   Unnamed: 0          Name  Age Country Gender  Salary  Tax(in %)  \
0           0           NaN   45      IN      F   73000         20
1           1    Ahmed Khan   38      IN      M   68000         20
2           2    Rachel Lee   29      US      F   62000         20
3           3    Jane Smith   29     CAN      F   62000         20
4           4   Emily Davis   31      US      F   58000         20
5           5      John Doe   29      US      M   55000         20
6           6        Li Wei   27      US      M   51000         20
7           7          Alex   27      US      U   47000         20
8           8   Carlos Ruiz   27    Mxco      M   45000         20
9           9  Maria Garcia   34     SPN      F   45000         10

   Salary_in_hand  Rank  Id
0           58400     1   6
1           54400     2   7
2           49600     3   8
3           49600     3   2
4           46400     4  10
5           44000     5   1
6           40800     6   5
7           37600     7   3
8           36000     8   9
9           36000     8   4

,Unnamed: 0,Name,Age,Country,Gender,Salary,Tax(in %),Salary_in_hand,Rank,Id
0,0,Ahmed Khan,45,IN,F,73000,20,58400,1,6
1,1,Ahmed Khan,38,IN,M,68000,20,54400,2,7
2,2,Rachel Lee,29,US,F,62000,20,49600,3,8
3,3,Jane Smith,29,CAN,F,62000,20,49600,3,2
4,4,Emily Davis,31,US,F,58000,20,46400,4,10
5,5,John Doe,29,US,M,55000,20,44000,5,1
6,6,Li Wei,27,US,M,51000,20,40800,6,5
7,7,Alex,27,US,U,47000,20,37600,7,3
8,8,Carlos Ruiz,27,Mxco,M,45000,20,36000,8,9
9,9,Maria Garcia,34,SPN,F,45000,10,36000,8,4

In [17]:
#handling duplicates
df_csv.duplicated()
new_df=df_csv.drop_duplicates().copy()
print(new_df)

   Unnamed: 0          Name  Age Country Gender  Salary  Tax(in %)  \
0           0           NaN   45      IN      F   73000         20
1           1    Ahmed Khan   38      IN      M   68000         20
2           2    Rachel Lee   29      US      F   62000         20
3           3    Jane Smith   29     CAN      F   62000         20
4           4   Emily Davis   31      US      F   58000         20
5           5      John Doe   29      US      M   55000         20
6           6        Li Wei   27      US      M   51000         20
7           7          Alex   27      US      U   47000         20
8           8   Carlos Ruiz   27    Mxco      M   45000         20
9           9  Maria Garcia   34     SPN      F   45000         10

   Salary_in_hand  Rank  Id
0           58400     1   6
1           54400     2   7
2           49600     3   8
3           49600     3   2
4           46400     4  10
5           44000     5   1
6           40800     6   5
7           37600     7   3
8           36000     8   9
9           36000     8   4

In [ ]:
#changing datatype

df_csv.loc[(df_csv['name'] == "Maria Garcia") & (df_csv['income'].isna()),'income'] = 70000
df_csv

df_csv['income']=df_csv['income'].astype(int)
print((df_csv['income']).dtype)

date_str="2025-02-10 00:17:52"
date_str=pd.to_datetime(date_str)
print(date_str,type(date_str))

int64
2025-02-10 00:17:52 <class 'pandas.Timestamp'>

In [23]:
#string cleaning

df_csv['gender'].str.capitalize()
df_csv['country'].str.lower()
df_csv['country'].str.upper()

df_csv['name']=df_csv['name'].str.strip()
df_csv['name'].str.split(" ")

df_csv['country'].str.contains("IN", case=False)

KeyError: 'gender'

In [ ]:
#transforming data

gender_map={"Male":"M","Female":"F","Unknown":"U"}
df_raw=pd.read_csv("raw_data.csv")
print(df_raw)    
df_raw['gender']=df_raw['gender'].map(gender_map).ffill()
print(df_raw)

df_raw['tax']=df_raw['income'].apply(lambda x:"20%" if x>=50000 else "10%")
df_raw['tax']

df_raw=df_raw.assign(new_income=df_raw['income']*1.1)
print(df_raw)

df_raw['country'].replace("USA",'US')
df_raw['income']=df_raw['new_income']
df_raw=df_raw.drop(columns=['new_income'])
print(df_raw['income'].ffill())

In [ ]:
df_raw.drop(columns=["tax"])
df_raw['tax']=df_raw['income'].apply(lambda x:20 if x>=60000 else 10)
df_raw

df_raw=df_raw.assign(income_after=df_raw['income']-(df_raw['income']*df_raw['tax']/100))
df_raw.drop(columns=['income'])


df_age=df_raw['age'].mean()
df_age

df_raw['age']=df_raw['age'].fillna(df_age)
df_raw['age']=df_raw['age'].astype(int)
df_raw.drop_duplicates(inplace=True)
df_raw

In [ ]:
df_raw2=df_raw.copy()

new_col=[col for col in df_raw.columns if col !='id']+['id']

df_raw2=df_raw2[new_col]
df_raw2

In [ ]:
df_copy=pd.read_csv("raw_data.csv")
df_copy

df_copy['tax(in %)']=df_copy['age'].apply(lambda x:20 if x>35 else 10)
df_copy.drop(columns=['tax(in %)'])

df_copy['tax(in %)']=df_copy['income'].apply(lambda x:20 if x>20 else 10)

#map
country_map={'USA':"US","Canada":"CAN","Mexico":"Mxco","India":"IN","Spain":"SPN"}
df_copy['country']=df_copy['country'].map(country_map)

#assign

df_copy=df_copy.assign(Income_in_hand=df_copy['income']-(df_copy['income']*df_copy['tax(in %)']/100))

#replace
df_copy=df_copy.replace("Male","M")
df_copy=df_copy.replace("Female","F")
df_copy=df_copy.replace("Unknown","U")

#rename
df_copy.columns=df_copy.columns.str.capitalize()
df_copy

df_copy.rename(columns={"Income":"Salary","Income_in_hand":"Salary_in_hand"},inplace=True)

#sort_values

df_copy.sort_values(['Salary_in_hand','Age'],ascending=False,inplace=True)

df_copy.drop_duplicates(inplace=True)

#sort_index

df_copy.sort_index()

#reset index

df_copy.reset_index(drop=True,inplace=True)
df_copy
#rank

df_copy['Rank']=df_copy['Salary'].rank(method="dense",ascending=False)

df_copy[['Salary','Salary_in_hand','Rank']]=df_copy[['Salary','Salary_in_hand','Rank']].ffill()
df_copy

df_copy[['Age']]=df_copy[['Age']].ffill()

df_copy[['Age','Salary','Salary_in_hand','Rank']]=df_copy[['Age','Salary','Salary_in_hand','Rank']].astype(int)
df_copy

#column reordering

new_columns= [col for col in df_copy.columns if col!='Id']+['Id'] #concate

df_copy=df_copy[new_columns]
print(df_copy)

In [ ]:
#writing in csv
df_copy.to_csv("raw_data.csv") #modify existing file

In [ ]:
#group by and aggregate functions
print(df_copy.groupby('Country')[['Salary','Age']].mean())

df_copy.groupby('Country')[['Salary','Salary_in_hand']].agg(['mean','max','min','sum'])

df_copy.groupby('Gender').agg(
 avg_salary=('Salary_in_hand',['mean','median']),
 avg_age=('Age','mean')
)

# df_copy.groupby('Gender').agg({
#     'Salary_in_hand':['mean','sum'],
#     'Age':['max','mean']
# })